# Задание: Присвоить переменной С значение “путь до своего каталога”. Перейти в этот каталог с использованием переменной.
printf "Текущий каталог: "  # Выводим текущий каталог
pwd
home_dir=$HOME  # Получаем домашний каталог пользователя
printf "Домашний каталог пользователя: %s\n" $home_dir  # Выводим домашний каталог пользователя
printf "Переход в новый каталог...\n"
cd $home_dir    # Переходим в домашний каталог пользователя
printf "Новый текущий каталог: "    # Выводим новый текущий каталог
pwd
exec bash
