# Задание: Командой TAR осуществляется сборка всех текстовых файлов текущего каталога в один архивный файл my.tar, после паузы просматривается содержимое файла my.tar, затем командой GZIP архивный файл my.tar сжимается.
tar -cf my.tar *.txt    # Создаем архив и указываем ему название (это делается с помощью ключа -с),
                        # Для упаковки содержимого в один файл используем ключ -f
printf "\nДля продолжения нажмите ENTER...\n"   # Ожидаем нажатие кнопки ENTER
read key    # Считываем введенное значение
cat my.tar  # Выводим содержимое файла
gzip my.tar # Сжимаем файл my.tar
echo # Выводим пустую строчку