# Задание: Вводятся целочисленные значения двух переменных. Вводится диапазон данных. Пока значения переменных находятся в указанном диапазоне, их значения инкрементируются.
printf "Введите первое число: "
read first_digit    # Считываем первое считанное число
printf "Введите второе число: "
read second_digit   # Считываем второе считанное число
printf "Введите левую границу интервала: "
read start_interval # Считываем начало интервала
printf "Введите правую границу интервала: "
read end_interval   # Считываем конец интервала
while [ $first_digit -ge $start_interval -a $first_digit -lt $end_interval -a $second_digit -ge $start_interval -a $second_digit -lt $end_interval ]
do  # Пока выполняется цикл
first_digit=$(($first_digit+1))     # Увеличиваем на едиинцу первое число
second_digit=$(($second_digit+1))   # Увеличиваем на единицу второе число
done    # Когда выполнение условия закончилось
echo "Полученное первое чило: $first_digit"     # Выводим полученное первое число
echo "Полученное второе чило: $second_digit"    # Выводим полученное второе число
