# Задание: Используя оператор FOR, отобразить содержимое текстовых файлов текущего каталога поэкранно.
list_files_dir=$(ls | grep .sh) #Получаем список всех файлов с расширением .sh
for file in $list_files_dir;    #Проходимся по всем элементам списка файлов
do  #Начинаем цикл
echo "Содержимое файла $file: " #Выводим название считываемого файла
echo $(cat $file)   #Выводим содержимое файла
read _  #Считываем введенное значение консоли
clear   #Очищаем экран после вывода содержимого файла
done    #Заканчиваем цикл
echo "Конец работы скрипта" #Выводим информационное сообщение
