# Задание: Анализируются атрибуты файла. Если первый файл существует и используется для чтения, а второй файл существует и используется для записи, то содержимое первого файла перенаправляется во второй файл. В случае несовпадений указанных атрибутов или отсутствия файлов на экран выдаются соответствующие сообщения 
# (использовать а) имена файлов; б) позиционные параметры).

echo "Пункт а (имена файлов for_sort_data.txt и result_task21.txt)"
firstFile=for_sort_data.txt     # Название первого файла
secondFile=result_task21.txt    # Название второго файла
if [ -f $firstFile -a -r $firstFile -a -f $secondFile -a -w $secondFile ]   # Проверяем необходимые условия
then
    cat $firstFile > $secondFile    # Перенаправлеяем содержимое первого файла во второй
else
    printf "Файл %s и(или) %s не существуют, либо обладают неправильными атрибутами!\n" $firstFile $secondFile
fi

# Позиционные параметры
echo "Пункт б (считываем названия файлов из аргументов)"
firstFile=$1    # Считываем первый аргумент команды (после названия скрипта)
secondFile=$2   # Считываем второй аргумент команды (после названия первого файла)
if [ -f $firstFile -a -r $firstFile -a -f $secondFile -a -w $secondFile ]   # Проверяем необходимые условия
then
    cat $firstFile > $secondFile    # Перенаправляем содержимого первого файла во второй
else
    printf "Файл %s и(или) %s не существуют, либо обладают неправильными атрибутами!\n" $firstFile $secondFile
fi