# Задание: Используя позиционные параметры, отобразить имя программы, количество аргументов командной строки, значение каждого аргумента командной строки.
printf "Имя программы: %s\n" $0 #Выводим имя программы (самый первый аргумент)
printf "Количество аргументов командной строки: %s\n" $#    #Выводим количество аргументов командной строки
printf "Список аргументов: \n"  #Начало вывода каждого аргумента
args="$@"   #Считываем все аргумент строки
for arg in $args;   #Проходим по всем аргументам и записываем их значение в переменную arg
do  #В цикле выводим
echo "$arg" #Выводим значение текущего аргумента
done    #Заканчиваем цикл вывода