# Задание: Если файл есть каталог и этот каталог можно читать, просматривается содержимое этого каталога. Если каталог отсутствует, он создается. Если файл не есть каталог, просматривается содержимое файла.
fileName=$1 # Считываем первый аргумент команды (после названия скрипта)
if [ -d "$fileName" -a -r "$fileName" ] # Проверяем, что указанный аргумент является каталогом и доступен для чтения
then
    ls $fileName    # Выводим содержимого каталога
elif [ -f "$fileName" ] # Проверяем, что указанный аргумент является файлом
then
    cat $fileName   # Выводим содержимое файла
else
    mkdir $fileName # В случае невыполнения вышеуказанных условий создаем данный каталог
fi