# Задание: Написать скрипт с использованием функции, например, функции, суммирующей значения двух переменных.

# Функция вычисления суммы двух чисел
sum_func() {
    if [ $# -gt 1 ]
    then
        res=$(expr $1 + $2)
        printf "Функция вычисления суммы: %s + %s = %s\n" $1 $2 $res
    else
        echo "Ошибка! В функцию переданы не все аргументы!"
    fi
}

# Функция вычисления разности двух чисел
minus_func() {
    if [ $# -gt 1 ]
    then
        res=$(expr $1 - $2)
        printf "Функция вычисления разности: %s - %s = %s\n" $1 $2 $res
    else
        echo "Ошибка! В функцию переданы не все аргументы!"
    fi
}

# Функция вычисления произведения двух чисел
mult_func() {
    if [ $# -gt 1 ]
    then
        res=$(expr $1 \* $2)
        printf "Функция вычисления произведения: %s * %s = %s\n" $1 $2 $res
    else
        echo "Ошибка! В функцию переданы не все аргументы!"
    fi
}

# Функция нахождения частного двух чисел
div_func() {
    if [ $# -gt 1 ]
    then
        res=$(expr $1 / $2)
        printf "Функция вычисления деления: %s / %s = %s\n" $1 $2 $res
    else
        echo "Ошибка! В функцию переданы не все аргументы!"
    fi
}

echo "=====МЕНЮ====="
echo "1. Сумма двух чисел"
echo "2. Разность двух чисел"
echo "3. Произведение двух чисел"
echo "4. Деление двух чисел"
printf "Введите номер желаемой команды:"
read numFunc    # Считываем номер введенной команды
echo    # Выводим пустую строку

case "$numFunc" in 
 "1" ) sum_func $1 $2   # Если введена 1
 echo "\nПример выполнения остальных функций"
 minus_func $1 $2
 mult_func $1 $2
 div_func $1 $2;;
 "2" ) minus_func $1 $2 # Если введена 2
 echo "\nПример выполнения остальных функций"
 sum_func $1 $2
 mult_func $1 $2
 div_func $1 $2;;
 "3" ) mult_func $1 $2  # Если введена 3
 echo "\nПример выполнения остальных функций"
 sum_func $1 $2
 minus_func $1 $2
 div_func $1 $2;;
 "4" ) div_func $1 $2   # Если введена 4
 echo "\nПример выполнения остальных функций"
 sum_func $1 $2
 minus_func $1 $2
 mult_func $1 $2;;
 * ) echo "Указан неправильный пункт";; # В любом другом случае
esac