# Задание: Вычислить объем цилиндра. Исходные данные запрашиваются программой. Результат выводится на экран.
printf "Вычисление объема цилиндра происходит по следующей формуле: V=pi*h*r^2\n"   #Вывод информационного сообщения о вычислении объема
printf "Введите значение радиуса: " #Спрашиваем значение радиуса
read r  #Считываем значение радиуса
printf "Введите значение высоты: "  #Спрашиваем значение высоты
read h  #Считываем значение высоты
v=$(echo 3.14*$r*$r*$h | bc)    #Рассчитываем объем цилинда
printf "Объем данного цилиндра равен (3.14*%s^2*%s): %s\n" $r $h $v
