# Задание: В качестве аргумента командной строки указывается пароль. Если пароль введен верно, постранично отображается в длинном формате с указанием скрытых файлов содержимое каталога /etc.
password=hardPassword   # Пароль для получения доступа
pswd=$1 # Берем первый аргумент (после названия скрипта)
if [ "$password" = "$pswd" ];   # Сравниваем переданное значение с проверочным
then
    cd /etc # Переходим в нужный каталог
    echo $(ls -a | less)    # Выводим содержимое каталога
else
    echo 'Неверный пароль!' # Если пароль оказался неправильным, то выводим сообщение
fi;
